{
    "version": "https://jsonfeed.org/version/1",
    "title": "Clykainc",
    "description": "",
    "home_page_url": "https://clykainc.net",
    "feed_url": "https://clykainc.net/feed.json",
    "user_comment": "",
    "author": {
        "name": "Clay"
    },
    "items": [
        {
            "id": "https://clykainc.net/2026-a-year-of-digital-seperation.html",
            "url": "https://clykainc.net/2026-a-year-of-digital-seperation.html",
            "title": "2026, a year of digital seperation",
            "summary": "Work In Progress The irony of the title to this blog post is that I am writing this on a computer and putting it on the internet - so much for the seperation eh? Maybe digitial seperation is more nuissanced then completely cutting out our&hellip;",
            "content_html": "<div class=\"log-header\"><strong><span class=\"log-number\">Work In Progress</span></strong>\n<p>The irony of the title to this blog post is that I am writing this on a computer and putting it on the internet - so much for the seperation eh?</p>\n<p>Maybe digitial seperation is more nuissanced then completely cutting out our grotesque modern consumption of media in our lives. I have seen the term floated around by some individuals in the philopshy and note-taking space that I follow about this idea of <strong>digital minimalism</strong>. The term \"minimalism\" is a loaded word, and can mean a varying degree from complete alienation of something to minimal adoption where necessary. For some the idea of being minimalist means trimming the fat and getting rid of the things that are taking up space physically <em>or even digitally</em>. These tend to be the things that don't benefit our own well-being, and have a habit of subconsciously eatting us away. I am moreso in this camp of thinking personally. That is the key point to underscore here, technology usage is and should be thought of as intentional consumption. I am far from a luddite of technology, but I can, and do, acknowledge that since we have come to depend on the internet for every aspect of our physical lives we have also lost a large part of what made us human as a byproduct to that cultural decision. Whether we had a vote in the decision or not, we have become so dependent that our consumption no longer feels like a intentional choice at our disposal, but one that we have to willingly accept as if we had an imaginary gun to our head. But here is the caveat, we as individuals do still control this... While difficult, we do have the autonomy to choose our own course of action and live more intentionally with technology in our current landscape. It just takes a bit of a bit of conscious effort, appropriate boundaries, and willingness to operate outside of the current societal norms. How hard can that be?</p>\n<p>At the time of writing this, I recently celebrated my 25th birthday. While not complete hysteria, I acknowledge that what I felt this past week has been a quarter-life crisis moment. You see while my generation didn't create the techno-sphere that was my parent's generation, we however are the generation to have embraced and circumvented using it into every facet of our lives. We are the byproduct of a beta-test and now we are realizing just how detrimental the results of our choices are. Specifically I am speaking for the the millenials and early 2000's babies.</p>\n<p>I currently go to school full-time. My reading, homework assignments, and even quizzes are done entirely online. If I want to check my work schedule, or try to find coverage for a shift I am using an app. </p>\n</div>",
            "author": {
                "name": "Clay"
            },
            "tags": [
                   "Blog"
            ],
            "date_published": "2026-01-20T14:57:57-05:00",
            "date_modified": "2026-01-20T15:01:41-05:00"
        }
    ]
}
